#+title: AI - Notebook
#+startup: overview hideblocks indent inlineimages
#+property: header-args:R :results output :noweb yes
#+property: header-args:python :results output :noweb yes :session *Python*
#+options: toc:1 num:1
** Trying this with the free version of ChatGPT

Stopped short of the 'optimization' step (accuracy of 30% was quite
bad).

1) Build a decision tree model from scratch. Split the data in
   training and test data, and make a prediction using the model. Then
   compute the accuracy of the model.
   #+begin_src python
     from random import shuffle
     from sklearn.metrics import accuracy_score

     # Create the dataset
     data_list = [
         {'Color': 'Red', 'Diameter': 7.5, 'Fruit Type': 'Apple'},
         {'Color': 'Purple', 'Diameter': 2.5, 'Fruit Type': 'Grape'},
         {'Color': 'Yellow', 'Diameter': 6.0, 'Fruit Type': 'Lemon'},
         {'Color': 'Green', 'Diameter': 4.0, 'Fruit Type': 'Apple'},
         {'Color': 'Yellow', 'Diameter': 5.5, 'Fruit Type': 'Lemon'}
     ]

     # Shuffle the data for randomness
     shuffle(data_list)

     # Split the data into training and test sets (80% training, 20% testing)
     split_ratio = 0.8
     split_index = int(len(data_list) * split_ratio)
     train_data = data_list[:split_index]
     test_data = data_list[split_index:]

     # Define a simple decision tree classifier
     def decision_tree_classifier(data):
         predictions = []
         for item in data:
             if item['Diameter'] <= 3.0:
                 predictions.append('Grape')
             elif item['Color'] == 'Red':
                 predictions.append('Apple')
             else:
                 predictions.append('Lemon')
         return predictions

     # Train the model and make predictions on the test data
     train_labels = [item['Fruit Type'] for item in train_data]
     test_labels = [item['Fruit Type'] for item in test_data]

     # Make predictions using the decision tree classifier
     predicted_labels = decision_tree_classifier(test_data)

     # Calculate the accuracy
     accuracy = accuracy_score(test_labels, predicted_labels)

     # Display the accuracy
     print(f"Accuracy: {accuracy * 100:.2f}%")
   #+end_src

   #+RESULTS:
   : Accuracy: 100.00%

2) Make a larger dataset of 1000 lines and split it into shuffled
   training and test data in the ratio 70:30.
   #+begin_src python
     import random
     from sklearn.model_selection import train_test_split

     # Create a list of fruit types
     fruit_types = ['Apple', 'Grape', 'Lemon']

     # Create a larger dataset with 1000 data points
     data_list = []

     for _ in range(1000):
         color = random.choice(['Red', 'Purple', 'Yellow', 'Green'])
         diameter = round(random.uniform(2.0, 8.0), 2)
         fruit_type = random.choice(fruit_types)
         data_list.append({'Color': color, 'Diameter': diameter, 'Fruit Type': fruit_type})

     # Shuffle the dataset for randomness
     random.shuffle(data_list)

     # Split the data into training and test sets (70% training, 30% testing)
     split_ratio = 0.7
     split_index = int(len(data_list) * split_ratio)
     train_data = data_list[:split_index]
     test_data = data_list[split_index:]

     # Display the sizes of the training and test sets
     print(f"Training data size: {len(train_data)}")
     print(f"Test data size: {len(test_data)}")
   #+end_src

   #+RESULTS:
   : Training data size: 700
   : Test data size: 300

3) Run the decision tree model from earlier on this new dataset and
   compute the accuracy of the prediction.
   #+begin_src python
     from sklearn.metrics import accuracy_score

     # Define the decision tree classifier function
     def decision_tree_classifier(data):
         predictions = []
         for item in data:
             if item['Diameter'] <= 3.0:
                 predictions.append('Grape')
             elif item['Color'] == 'Red':
                 predictions.append('Apple')
             else:
                 predictions.append('Lemon')
         return predictions

     # Split the new dataset into features and labels
     test_labels = [item['Fruit Type'] for item in test_data]

     # Make predictions using the decision tree classifier
     predicted_labels = decision_tree_classifier(test_data)

     # Calculate the accuracy
     accuracy = accuracy_score(test_labels, predicted_labels)

     # Display the accuracy
     print(f"Accuracy: {accuracy * 100:.2f}%")
   #+end_src

   #+RESULTS:
   : Accuracy: 30.67%

